# Perimeter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Zone..::..Perimeter Property
Zone Class See Also
---
Get the Perimeter of the Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Perimeter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Perimeter As Double
	Get
```

Visual C++
---
```text
public:
property double Perimeter {
	double get ();
}
```

# Remarks
This property is used to get the Perimeter of the Zone.
# See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace